[
    {
        "title": "Course Completion Certificate",
        "content": "On December 22, 2024, Dean Didion successfully completed the online non-credit course \"What is Data Science?\" authorized by IBM and offered through Coursera. This course was verified by Rav Ahuja, Global Program Director, Skills Network, and Alex Aklson, Ph.D., Data Scientist. You can verify this certification at https://coursera.org/verify/TF5A45NN7C7L. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Python Project for Data Science Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course authorized by IBM and offered through Coursera. Certificate awarded to Azim Hirjani, Cognitive Data Scientist, and Joseph Santarcangelo, Senior Data Scientist at IBM. Verify at: https://coursera.org/verify/1S6F5HYC6HCN. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Fundamentals to Become a Machine Learning Engineer",
        "content": "Learning Path completed by Dean Didion on Sep 14, 2024 at 11:08 AM UTC for a total duration of 10 hours and 22 minutes. Top skills covered include Machine Learning. Certificate ID: f8ca8786f13fc583ff05e54616fb679b6e86b4ce83505b50ca5241c37c8ef905.",
        "category": "certificate"
    },
    {
        "title": "PMI Agile Certified Practitioner Course Completion",
        "content": "Cert Prep: PMI Agile Certified Practitioner (PMI-ACP)®\nCourse completed by Dean Didion on Sep 07, 2023, at 09:04 AM UTC, duration 1 hour 53 minutes. Top skills covered include Project Management and Agile Project Management. The PMI Registered Education Provider logo is a registered mark of the Project Management Institute, Inc. Program: PMI® Registered Education Provider, Provider ID: #4101, Activity #: 4101T4TJXX, PDUs/Contact Hours: 1.75. Certificate ID: ac2afe8fb5c6bd1d127b8018ce228e66e9d7f1ffab02594ec00fd15aa6292b2c.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Introduction to Artificial Intelligence (AI)",
        "content": "Dean Didion has successfully completed the online non-credit course \"Introduction to Artificial Intelligence (AI)\" authorized by IBM and offered through Coursera. This certificate is verified by the Global Program Director of Skills Network, Rav Ahuja. Verify at: https://coursera.org/verify/IOMRMEG5BCA. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Data Analysis with Python Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course, Data Analysis with Python, authorized by IBM and offered through Coursera. This certification confirms the identity of Joseph Santarcangelo, Senior Data Scientist at IBM. Verify at: https://coursera.org/verify/3VPTXKHPKFZ1",
        "category": "certificate"
    },
    {
        "title": "Project Portfolio Management Foundations Certificate",
        "content": "Course completed by Dean Didion on September 7, 2023, at 02:17 PM UTC. Duration: 1 hour 15 minutes. Top skills covered include Project Portfolio Management. The PMI Registered Education Provider logo is a registered mark of the Project Management Institute, Inc. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 41013NM533. PDUs/Contact Hours: 1.25. Certificate ID: 38f8fc1449062819f442daf1294ce1927ebe501c89dfa18351668bc46ab23862.",
        "category": "certificate"
    },
    {
        "title": "Agile Challenges Weekly Tips",
        "content": "Agile Challenges Weekly Tips\nCourse completed by Dean Didion on Sep 07, 2023, at 04:15 PM UTC lasting 2 hours 22 minutes.\nTop skills covered include Agile Project Management.\nCertificate ID: a45505d4d1b3d2cea332a83827184719454f590e0b72f49cdbffa798796561b0. \nRole: Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Machine Learning with Python: Foundations",
        "content": "Course completed by Dean Didion on Sep 11, 2024 at 01:06 PM UTC. Duration: 1 hour 54 minutes. Top skills covered include Machine Learning and Python (Programming Language). Certificate ID: 2297a688b31d4b65ab032cd6d3c87b51b18e759fc34a8286d9691e37a22bb2b7.",
        "category": "certificate"
    },
    {
        "title": "Course Completion Certificate for Building Generative AI-Powered Applications with Python",
        "content": "On October 15, 2024, Dean Didion successfully completed the online non-credit course 'Building Generative AI-Powered Applications with Python,' authorized by IBM and offered through Coursera. The course's identity has been verified by Coursera, confirming their participation. Verify at: https://coursera.org/verify/LWNS6IJ8RCYO",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion: Machine Learning with Python",
        "content": "Dean Didion has successfully completed the online non-credit course \"Machine Learning with Python\" authorized by IBM and offered through Coursera. This certification was issued to Joseph Santarcangelo, Senior Data Scientist at IBM. The course was verified by Jeff Grossman, Subject Matter Expert at Skill-Up Technologies. You can verify this certificate at: https://coursera.org/verify/UMOBLHMPFVE6. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Introduction to Information Technology and AWS",
        "content": "Dec 15, 2024 Dean Didion Introduction to Information Technology and AWS Cloud an online non-credit course authorized by Amazon Web Services and offered through Coursera has successfully completed Rafael Lopes Principal Cloud Technologist AWS Training & Certification Morgan Willis Senior Cloud Technologist AWS Training and Certification Verify at: https://coursera.org/verify/O4NBTFNUDV1E Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Negotiating with Agility",
        "content": "Course completed by Dean Didion on Sep 07, 2023 at 02:44 PM UTC. Duration: 1 hour 7 minutes. Top skills covered: Negotiation. Certificate ID: 1d249d84de994311f7c4b102ec62872384a092346cfdc007aa6d87a7bcf538de. Role: Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Certificate Information",
        "content": "All the certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to the appropriate person.",
        "category": "certificate"
    },
    {
        "title": "Data Science Methodology Certificate",
        "content": "On January 13, 2025, Dean Didion successfully completed the online non-credit course 'Data Science Methodology', authorized by IBM and offered through Coursera. The participant is Alex Aklson, Ph.D., a Data Scientist. The course was verified by Coursera, which confirmed the identity of this individual and their participation in the course. For verification, visit: https://coursera.org/verify/K0G64KL4SQPR.",
        "category": "certificate"
    },
    {
        "title": "Scrum Master Certification",
        "content": "Cert Prep: Scrum Master\nCourse completed by Dean Didion on September 07, 2023, at 04:07 PM UTC. Duration: 1 hour 26 minutes.\n\nTop skills covered: Scrum.\n\nProgram: PMI® Registered Education Provider\nProvider ID: #4101\nActivity #: 41018ZJJPW\nPDUs/Contact Hours: 1.25\nCertificate ID: 1454bc489d02ad3e03a4383230eb30f577a772fac74df8c32b8ad33319d0d238.\n\nThis document represents the completion of the course and is authorized by the Project Management Institute, Inc.",
        "category": "certificate"
    },
    {
        "title": "Introduction to Project Management Completion Certificates",
        "content": "On April 1, 2025, Dean Didion has successfully completed the online non-credit course, \"Introduction to Project Management,\" authorized by IBM and offered through Coursera. The following individuals have completed this course: Bethany Hudnutt, Kasie Kyle, and Rav Ahuja. You can verify this information at: https://coursera.org/verify/MA3HHPHW2SGR. Coursera has confirmed the identity of these individuals and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Agile at Work: Planning with Agile User Stories",
        "content": "Course completed by Dean Didion on September 07, 2023, at 03:24 PM UTC. Duration: 51 minutes. Skills covered include Agile Methodologies and User Stories. This certificate is issued by the PMI Registered Education Provider (Provider ID: #4101, Activity #: 4101ECBBFV). It grants 1.00 PDUs/Contact Hours.",
        "category": "certificate"
    },
    {
        "title": "Personal Reference Letter",
        "content": "Payoneer Germany GmbH\nPhone: +49 (89) 41 41 447 0\nManaging Director: Scott Galit, Keren\nDeutsche Bank\nGanghoferstr. 39\nFax: +49 (89) 41 41 447 99\nLevy-Shalev, Jonas Maurus\nIBAN: DE20 7007 0010 0033 9382 00\n80339 Munich\nE-Mail: welcome@payoneer.net\nComm. Register Munich HRB 183178\nSWIFT (BIC): DEUTDEMMXXX\nGermany\nWeb: www.payoneer.com\nTax No: DE268847980",
        "category": "certificate"
    },
    {
        "title": "Machine Learning with Python Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course 'Machine Learning with Python' authorized by IBM and offered through Coursera. The completion is verified for Joseph Santarcangelo, Senior Data Scientist at IBM. The Subject Matter Expert for the course was Jeff Grossman from Skill-Up Technologies. You can verify this completion at: https://coursera.org/verify/UMOBLHMPFVE6. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates of Completion",
        "content": "All the certificates and information have been completed by Dean Didion. Certificates previously assigned incorrectly have now been correctly assigned to the respective individuals. The document contains updated information regarding the certificates and the individuals who have earned them.",
        "category": "certificate"
    },
    {
        "title": "Completion Certificate for Data Science Course",
        "content": "Dean Didion has successfully completed the online non-credit course \"What is Data Science?\" authorized by IBM and offered through Coursera. This certificate is verified by Rav Ahuja, Global Program Director at Skills Network, and Alex Aklson, Ph.D., Data Scientist. Verify at: https://coursera.org/verify/TF5A45NN7C7L. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Generative AI: Prompt Engineering Basics",
        "content": "Dean Didion has successfully completed the online non-credit course authorized by IBM and offered through Coursera. This certification confirms Antonio Cangiano's participation as an Engineering Manager and AI Specialist in the course. The verification is provided by Rav Ahuja, Global Program Director at Skills Network. For verification details, please visit: https://coursera.org/verify/85YS4SW0W0V8.",
        "category": "certificate"
    },
    {
        "title": "DevOps Professional Certificate",
        "content": "DevOps Professional Certificate by PagerDuty and LinkedIn Learning Path completed by Dean Didion on Aug 05, 2024, at 12:37 PM UTC with a duration of 7 hours and 13 minutes. Top skills covered include Continuous Integration and Continuous Delivery (CI/CD), DevOps, and Infrastructure as Code (IaC). Certificate ID: 065bbcdac8668789c970aa4c44b369ac04a5947640d59df959ebedb4152d2024. Dean Didion holds the position of Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Fundamentals of AI Agents Using RAG and LangChain",
        "content": "This is to certify that Ashutosh Sagar, Fateme Akbari, Joseph Santarcangelo, and Kang Wang have successfully completed the online non-credit course titled 'Fundamentals of AI Agents Using RAG and LangChain', authorized by IBM and offered through Coursera. Verify at: https://coursera.org/verify/1NAUZX94N0PJ. Coursera has confirmed the identity of these individuals and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Introduction to HTML, CSS, & JavaScript",
        "content": "On October 10, 2024, Dean Didion has successfully completed the online non-credit course \"Introduction to HTML, CSS, & JavaScript,\" authorized by IBM and offered through Coursera. The individuals verified are Michelle Saltoun, Software Developer at IBM, and Upkar Lidder, Senior Software Engineer at IBM. You can verify at: https://coursera.org/verify/V8S3DOCL6. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Generative AI Language Modeling with Transformers Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course \"Generative AI Language Modeling with Transformers\" authorized by IBM and offered through Coursera. The following individuals have successfully completed the course: Fateme Akbari, Joseph Santarcangelo, Adrian Wang. Verify at: https://coursera.org/verify/ADNNN5Q7DMTF. Coursera has confirmed the identity of these individuals and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to reflect the appropriate recipients. This document contains a record of those updated certificates and assignments, ensuring clarity and accuracy in our records.",
        "category": "certificate"
    },
    {
        "title": "Python for Data Science, AI & Development Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course \"Python for Data Science, AI & Development,\" authorized by IBM and offered through Coursera. This certification is awarded to Joseph Santarcangelo, Senior Data Scientist at IBM. Verify at: https://coursera.org/verify/D7RX0XR5CP7I. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Generative AI for Business Leaders Course Completion",
        "content": "Generative AI for Business Leaders course has been completed by Dean Didion on July 17, 2024, at 08:20 AM UTC. The course covered top skills in Business Strategy and Artificial Intelligence for Business. It was delivered via QAS Self Study. In accordance with the standards of the National Registry of CPE Sponsors, CPE credits have been granted based on a 50-minute hour. LinkedIn is registered with the National Association of State Boards of Accountancy (NASBA) as a sponsor of continuing professional education. State boards of accountancy have the final authority on the acceptance of individual courses for CPE credit. Complaints regarding registered sponsors may be submitted to the National Registry of CPE Sponsors through the website www.nasbaregistry.org. This course falls under the field of study: Personal Development. The program has a NASBA Registry ID of #140940 and grants 1.80 Continuing Professional Education Credits (CPE). The certificate ID for this course is 4e76dcc5231a6d7017fed1a2ca836434c1b448fa392d7cbe77a8224883dd7678.",
        "category": "certificate"
    },
    {
        "title": "Agile Product Owner Role: Foundations Certificate",
        "content": "Agile Product Owner Role: Foundations course completed by Dean Didion on Sep 07, 2023, at 01:53PM UTC. The duration of the course was 1 hour and 7 minutes. Top skills covered in this course include Agile Project Management. This course is provided by the PMI® Registered Education Provider with Provider ID: #4101 and Activity #: 4101U2ZV1X. It counts for 1.00 PDUs/Contact Hours. The Certificate ID is f4c71742c39d030d953aaf6b5035b62437365776d3a62d2788219869bce73c93. Dean Didion holds the position of Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "What is Copilot? Get Started with Microsoft's Everyday AI Companion",
        "content": "Course completed by Dean Didion on Aug 19, 2024 at 12:15 PM UTC. Duration: 15 minutes. Top skills covered include Artificial Intelligence for Business and Microsoft Copilot. Certificate ID: 60589d997ba84a052ce2fad4c6784c91ea191b5feba3f1fa866c8c5475c0fd0b. Role: Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Introduction to DevOps Completion Certificate",
        "content": "Dean Didion has successfully completed the Introduction to DevOps, an online non-credit course authorized by IBM and offered through Coursera. This certificate is awarded to John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center. Verify at: https://coursera.org/verify/ZY1Z7VPR9Q27. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Python for Data Science, AI & Development Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course \"Python for Data Science, AI & Development\", authorized by IBM and offered through Coursera. \n\nJoseph Santarcangelo  \nSenior Data Scientist \nIBM \n\nVerify at: https://coursera.org/verify/D7RX0XR5CP7I  \nCoursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Introduction to Agile Development and Scrum Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course titled 'Introduction to Agile Development and Scrum', authorized by IBM and offered through Coursera. The course has been verified for John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center. Verify at: https://coursera.org/verify/NDB0YXVFTCT6. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "DevOps Capstone Project Completion Certificate",
        "content": "On December 13, 2024, Dean Didion has successfully completed the DevOps Capstone Project, an online non-credit course authorized by IBM and offered through Coursera. This certificate validates the participation of John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center, and Upkar Lidder, Senior Software Engineer at IBM. Verify at: https://coursera.org/verify/E2CZJUJSSVM2. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All the certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to the appropriate personnel.",
        "category": "certificate"
    },
    {
        "title": "Generative AI: Elevate Your Data Science Career Certificate",
        "content": "This certifies that Abhishek Gagneja has successfully completed the online non-credit course 'Generative AI: Elevate Your Data Science Career', authorized by IBM and offered through Coursera. Verify at: https://coursera.org/verify/IPXRPVB9EBK1. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "IBM Applied DevOps Engineering Certificate",
        "content": "Dean Didion has successfully completed the online, non-credit Professional Certificate in IBM Applied DevOps Engineering. In this Professional Certificate, learners mastered DevOps practices, Agile methodologies, and Cloud Native Technologies. The holders of this certificate completed numerous hands-on labs and projects to gain practical DevOps experience. They utilized Scrum and wrote and executed agile user stories using a Kanban board; built and deployed Python microservices using Docker containers, Kubernetes, OpenShift, and Serverless; developed and executed unit tests with test-driven development (TDD) methods; applied the process of Continuous Integration / Continuous Development (CI/CD) with GitHub Actions and Tekton, added monitoring, logging and observability, and ensured security. The completers of the Professional Certificate are now ready to take on Software Engineering challenges using a DevOps mindset. The online specialization named in this certificate may draw on material from courses taught on-campus, but the included courses are not equivalent to on-campus courses. Participation in this online specialization does not constitute enrollment at this university. This certificate does not confer a University grade, course credit or degree, and it does not verify the identity of the learner. Verify this certificate at: https://coursera.org/verify/professional-cert/YG2HCI8SQXHH",
        "category": "certificate"
    },
    {
        "title": "Agile Software Development: Scrum for Developers Certificate",
        "content": "Course completed by Dean Didion on Aug 21, 2023 at 02:26 PM UTC. Duration: 1 hour 15 minutes. Top skills covered: Agile Software Development, Scrum. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 4101PXZTX2. PDUs/Contact Hours: 1.25. Certificate ID: 02ad587317998eeae95a3ac43b414ebb477797ed1580af0eb7da94d3e2605654.",
        "category": "certificate"
    },
    {
        "title": "Continuous Integration and Continuous Delivery Certificate",
        "content": "Dean Didion\nContinuous Integration and Continuous Delivery (CI/CD)\nan online non-credit course authorized by IBM and offered through Coursera\nhas successfully completed\nJohn J. Rofrano\nSenior Technical Staff Member and DevOps Champion\nIBM T.J. Watson Research Center\nVerify at: \nhttps://coursera.org/verify/Q3OKSTNFV8OA\nCoursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Six Sigma: White Belt Certificate",
        "content": "Six Sigma: White Belt Course completed by Dean Didion on Aug 14, 2024 at 02:09 PM UTC. Duration: 56 minutes. Top skills covered: Six Sigma. Certificate ID: db90c50248a64c50f3b64fa3ec5dba106d5dfb10b625b94949fe0765ad650f50.",
        "category": "certificate"
    },
    {
        "title": "Career Essentials in GitHub",
        "content": "Career Essentials in GitHub is a professional certificate program completed by Dean Didion on July 28, 2024, at 11:19 AM UTC. The course took a total of 4 hours and 18 minutes. Top skills covered in this program include GitHub. The certificate ID is 8d006683b191f45657f76aee0e83d991c8216e3ea214511e6bcf9c6690fb5375. Dean Didion holds the position of Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "AWS Cloud Technical Essentials Completion Certificate",
        "content": "Dean Didion has successfully completed the AWS Cloud Technical Essentials, an online non-credit course authorized by Amazon Web Services and offered through Coursera. This certificate is awarded to Morgan Willis, Senior Cloud Technologist, AWS Training and Certification. Verify at: https://coursera.org/verify/J92IY44WO7YE. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Course Completion Certificate",
        "content": "On March 3, 2025, Joseph Santarcangelo, a Senior Data Scientist at IBM, successfully completed the online non-credit course \"Gen AI Foundational Models for NLP & Language Understanding,\" authorized by IBM and offered through Coursera. This is verified at: https://coursera.org/verify/YG559JQQ80PM. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Python for Data Science, AI & Development",
        "content": "Dean Didion has successfully completed the online non-credit course \"Python for Data Science, AI & Development\" authorized by IBM and offered through Coursera. The completion is verified for Joseph Santarcangelo, Senior Data Scientist at IBM. Verify at: https://coursera.org/verify/D7RX0XR5CP7I. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Atlassian Agile Project Management Professional Certificate",
        "content": "Atlassian Agile Project Management Professional Certificate\nLearning Path completed by Dean Didion\nJul 26, 2024 at 07:00PM UTC 7 hours 16 minutes\nTop skills covered: Jira, Agile Methodologies, Agile Project Management\nCertificate ID: 58871b65e5f6fbd1ad7ab025a097727658a4346ede2250fc9c70965136ff918e\nHead of Global Content, Learning",
        "category": "certificate"
    },
    {
        "title": "Personal Reference Letter for Dean",
        "content": "Payoneer Germany GmbH\\nPhone: +49 (89) 41 41 447 0\\nManaging Director: Scott Galit, Keren\\nDeutsche Bank\\nGanghoferstr. 39\\nFax: +49 (89) 41 41 447 99\\nLevy-Shalev, Jonas Maurus\\nIBAN: DE20 7007 0010 0033 9382 00\\n80339 Munich\\nE-Mail: welcome@payoneer.net\\nComm. Register Munich HRB 183178\\nSWIFT (BIC): DEUTDEMMXXX\\nGermany\\nWeb: www.payoneer.com\\nTax No: DE268847980\\n\\nThis is to certify that Dean has been employed as a Senior Engineering Manager for the Merchant Management and Merchant Onboarding team at Payoneer for a period of two and a half years. During this tenure, Dean has made significant contributions to the organization and demonstrated exemplary skills and expertise in various aspects of the role.\\n\\nAs the Senior Engineering Manager, Dean led a team consisting of 5 Backend, 3 Frontend, 3 delivery/quality assurance engineers, and 2 designers. The team was responsible for the development and maintenance of critical portals, including the Merchant Orchestration Portal, New Checkout Portal, and Stand-alone Merchant Portal for Checkout.\\n\\nUnder Dean's leadership, the team handled a wide range of responsibilities, encompassing design, user interface (UI), user experience (UX), and core services for the entire organization. This included the development of essential services such as authentication and authorization, onboarding APIs, and merchant configuration APIs.\\n\\nAs the first engineering manager hired for this role, Dean played a vital role in building and shaping the team from its inception. This involved actively participating in the recruitment and onboarding process and establishing a solid infrastructure to support the team's operations as well as making a big contribution in onboarding other Engineering Managers as they were hired into the organization. Dean's efforts were instrumental in creating a strong foundation and setting the stage for subsequent engineers to thrive.\\n\\nThroughout the tenure, Dean demonstrated exceptional managerial skills, effective communication, and a dedication to mentoring team members. By leveraging their extensive knowledge of different Agile frameworks, Dean introduced and implemented numerous processes that significantly enhanced the team's performance. These processes were so successful that they were subsequently adopted by other teams within the organization.\\n\\nFurthermore, Dean organized workshops at both the team and organizational levels, fostering a culture of continuous learning and knowledge sharing. These initiatives played a crucial role in increasing the collective knowledge base of the team and breaking down silos between different departments.\\n\\nDean's work consistently exhibited a high level of quality, earning the admiration and recognition of both peers and direct reports. Their commitment to excellence, leadership abilities, and expertise in the field of engineering management have been invaluable to the success of the organization.\\n\\nTherefore, it is with great pleasure that we acknowledge Dean's contributions and recommend them as an outstanding Senior Engineering Manager with a proven track record of achieving exceptional results. We extend our sincere appreciation for their dedication and significant impact during their tenure at Payoneer.",
        "category": "reference letter"
    },
    {
        "title": "Certificate of Course Completion",
        "content": "On October 2, 2024, Dean Didion completed the online non-credit course \"Developing AI Applications with Python and Flask,\" authorized by IBM and offered through Coursera. This course was successfully completed by Abhishek Gagneja, who is recognized as a Python and AI Subject Matter Expert, and Ramesh Sannareddy, who is a Data Engineering Subject Matter Expert at Skill-up Technologies. You can verify this completion at: https://coursera.org/verify/5GQQ6NA08MTI. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Agile Product Owner Role: Techniques",
        "content": "Course completed by Dean Didion on September 7, 2023, at 01:59 PM UTC. Duration: 1 hour 24 minutes.\nTop skills covered: Agile Methodologies.\nProvider Information:\n- Program: PMI® Registered Education Provider\n- Provider ID: #4101\n- Activity #: 410102O5PR\n- PDUs/Contact Hours: 1.25\n- Certificate ID: 47130b82b004df8055935ae26fdb2de001c5b08394bf3468bf40172ec091466a",
        "category": "certificate"
    },
    {
        "title": "Enterprise Agile: Changing Your Culture",
        "content": "Course completed by Dean Didion on Sep 07, 2023, at 02:07 PM UTC. Duration: 1 hour 22 minutes. Top skills covered include Agile Methodologies and Organizational Culture. This course is provided by PMI® Registered Education Provider, Provider ID: #4101, Activity #: 4101HVZ7KC, with PDUs/Contact Hours: 1.25. Certificate ID: 5464cf0a31d49b58c863277a10ff302fc8fa653f6770196e13dbe943f5dbd07c.",
        "category": "certificate"
    },
    {
        "title": "Generative AI: Introduction and Applications",
        "content": "Dean Didion has successfully completed the online non-credit course 'Generative AI: Introduction and Applications,' authorized by IBM and offered through Coursera. This course completion has been verified by Rav Ahuja, Global Program Director, Skills Network. Coursera has confirmed the identity of this individual and their participation in the course. Verify at: https://coursera.org/verify/X9LHATMGBCGO",
        "category": "certificate"
    },
    {
        "title": "IBM Data Science Professional Certificate",
        "content": "Rav Ahuja has successfully completed the online, non-credit Professional Certificate in IBM Data Science. In this Professional Certificate, learners developed and honed hands-on skills in Data Science and Machine Learning. Learners started with an orientation of Data Science and its Methodology, became familiar with and used a variety of data science tools, learned Python and SQL, performed Data Visualization and Analysis, and created Machine Learning models. In the process, they completed several labs and assignments on the cloud, including a Capstone Project at the end to apply and demonstrate their knowledge and skills. The online specialization named in this certificate may draw on material from courses taught on-campus, but the included courses are not equivalent to on-campus courses. Participation in this online specialization does not constitute enrollment at this university. This certificate does not confer a University grade, course credit or degree, and it does not verify the identity of the learner. Verify this certificate at: https://coursera.org/verify/professional-cert/XBUKLSUI8F82",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All certificates and information have been completed by Dean Didion. Each certificate has been accurately assigned to the appropriate individual, ensuring no misattribution of certificates has occurred.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion: Introduction to Software Engineering",
        "content": "This certifies that Dean Didion has successfully completed the online non-credit course, Introduction to Software Engineering, authorized by IBM and offered through Coursera. Course Instructors: Lin Joyner, Senior Instructional Designer & Content Developer; Rav Ahuja, Global Program Director; Bethany Hudnutt, Instructional Designer at Skill Up Technologies. Verify at: https://coursera.org/verify/U8XL0R8PY8VP. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Dean Didion's Resume",
        "content": "CONTACT +49 0151 1799 6699 dean.didion@icloud.com Portfolio GitHub LinkedIn TECHNICAL SKILLS Project Management Agile Leadership & Methodologies AI Engineering LLMs AI Ethical Officer Data Science CI/CD SDLC DEAN DIDION IT MANAGER / ENGINEERING MANAGER WORK EXPERIENCE PROFILE A seasoned IT Project and Engineering Manager with a focus on AI technologies such as LangChain, LangGraph, Machine Learning, and Data Science. Expertise in spearheading cross-functional teams and refining agile methodologies (Scrum, Kanban, Hybrid). Proficient in recruitment, onboarding, and nurturing a culture of improvement, delivering high-impact solutions and overseeing global collaborations. Jan 2024 - Present Remote SureStride Founder & CEO Founded and led a successful Agile coaching enterprise, implementing customized methodologies that increased team productivity by 30%. Designed and delivered targeted training programs, streamlined processes, and introduced continuous improvement frameworks, leading to a 25% reduction in project delivery times and improved cross-functional collaboration. Advised engineering teams and leadership on agile best practices, fostering a culture of adaptability and iterative development that enhanced stakeholder engagement and product quality. Aug 2023 - May 2024 Edinburgh / Singapore LifeScience Technology LTD CTO (Freelance) Defined and led the technical strategy for an early-stage startup, building and managing high-performing distributed engineering teams across Singapore and the UK. Directed end-to-end technical hiring and mentorship programs, establishing a scalable engineering foundation and fostering a performance-driven team culture. May 2021 - Oct 2023 Munich, Germany Payoneer (Nasdaq: PAYO) Sr. Engineering Manager Spearheaded multiple greenfield projects, including Checkout and the OKR program, successfully adopted across teams in Germany, the UK, and Israel, driving alignment and strategic execution. Led monthly Agile transformation workshops and mentored three cross-functional engineering teams, enhancing effectiveness and interdepartmental collaboration, resulting in improved delivery speed and stakeholder engagement. May 2019 - Nov 2020 Töging, Germany ViscoTec GmbH Head of Customer Support Established a customer support division from the ground up, optimizing operations and increasing customer satisfaction by 35% through improved processes. Apr 2017 - May 2019 Sulgen, Switzerland Belimed Lifescience GmbH Head of Global Installations & Qualifications Led the development of a global service network for a top pharmaceutical firm, optimizing procedures and cutting installation time by 20%, driving a 70% increase in client satisfaction. Sep 2000 - Mar 2016 Canada, Australia, USA, Germany Giesecke & Devrient GmbH IT Project Manager / Software Engineer Directed global EMV card processing strategies, enhancing operational efficiency and security measures while fostering high-performing teams. SOFT SKILLS Problem solving, Critical thinking, Communication, Project Management, Servant Leadership CERTIFICATIONS IBM IT Project Manager PMI Project Management IHK Project Manager ISO 9001 QM-A (Auditor) Six Sigma Blackbelt IBM AI Developer IBM Data Scientist IBM DevOps Engineering IBM Gen AI with LLMs EDUCATION Oct 2024 - Dec 2025 Masterschool Software Engineering Completed a 14-month training specializing in AI and Backend Engineering, focusing on Python, Web Applications, OOP, Databases, SQL, Linux, Flask, HTML, CSS, Docker, and Cloud technologies. LANGUAGES English Native German Native Esperanto B2 Apr 1998 - Sep 2006 Leeds University UK Bachelor of Science (B.Sc.) - Mechanical Engineering Sep 1994 - Jul 1996 Dr. Blindow Schule Bachelor Professional Technik German Highschool Diploma Sep 1994 - Jul 1996 School of Electrical, Mechanical Engineers Electrical & Mechanical Engineering, B-Tec PROJECTS PraxisManager Mar 2025 (Private Repo: Walkthrough on request) Tools: Python, TKinter, MySQL Designed and developed a business management application to replace existing legacy software for a Heilpraktiker (alternative medicine) practice. Streamlined appointment scheduling, patient records, and financial tracking, improving operational efficiency. ThriveWell Jan 2025 GitHub Tools: FastAPI, LangGraph, PostgreSQL Developed an AI-driven chatbot to provide personalized mental health support and daily motivation using LangGraph. They adapt to individual needs and enhance user engagement through natural language understanding and contextual awareness. the-companion Jan 2025 GitHub Tools: Flask, WhatsApp API, AI, Natural Language Processing Developed an AI-powered WhatsApp chatbot to support seniors in maintaining their health. Simplified daily tasks, offered medication reminders, and provided access to important health information through WhatsApp conversations. Application for the Foundation for Civic Engagement and Volunteering currently pending. VOLUNTEERING Mücheln Highschool Volunteer English and Python Programming Instructor: Designed and delivered volunteer Python programming and English workshops for high school students, introducing core concepts through hands-on projects and tutoring sessions.",
        "category": "CV"
    },
    {
        "title": "Becoming an Agile Coach",
        "content": "Course completed by Dean Didion on Sep 07, 2023, lasting 46 minutes. Top skills covered: Agile Coaching. This course is offered by a PMI Registered Education Provider (Provider ID: #4101, Activity #: 4101TJP1WO), and provides 0.75 PDUs/Contact Hours. The Certificate ID is 778bcb21eba26ba57e8a7dd8f9b6e73b2c88268a25917d37543952561b66b82a.",
        "category": "certificate"
    },
    {
        "title": "Digital Transformation Certificate",
        "content": "Digital Transformation course completed by Dean Didion on September 07, 2023 at 02:03 PM UTC, lasting 47 minutes. Top skills covered include Digital Transformation. Certificate ID: 2c2d7204dd9afa8186c9c34c832825379317f6dae45dc4a5ca72e815b1a1596b. Dean Didion holds the position of Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Application Security for Developers and DevOps Professionals",
        "content": "On December 10, 2024, Dean Didion successfully completed the online non-credit course \"Application Security for Developers and DevOps Professionals,\" authorized by IBM and offered through Coursera. John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center, confirms this completion. Verify at: https://coursera.org/verify/YDI5K5YUS6IX. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates from Dean Didion",
        "content": "All certificates and information have been completed by Dean Didion. Please refer to the assigned certificates for the correct recipients.",
        "category": "certificate"
    },
    {
        "title": "Adaptive Project Leadership Certificate",
        "content": "Course completed by Dean Didion on September 7, 2023, at 08:20 AM UTC. Duration: 47 minutes. Top skills covered: Project Leadership. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 4101WEFZ3B. PDUs/Contact Hours: 0.75. Certificate ID: eae4e8aa6622ee014dbd1500562e0b4a6554ef288ce3e9cb9bd3d5762c548914. Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Certificate Completion Summary",
        "content": "All certificates and information have been completed by Dean Didion. Each certificate has been correctly assigned to the appropriate individual, ensuring accuracy in documentation.",
        "category": "certificate"
    },
    {
        "title": "OpenEDG Python Institute: Programming with Python Professional Certificate",
        "content": "Learning Path completed by Dean Didion. Achieved on September 09, 2024, at 03:34 PM UTC. Duration: 7 hours and 15 minutes. Top skills covered include Python (Programming Language) and Object-Oriented Programming (OOP). Certificate ID: d71df37f572127af6edffdbc4e3ee1bdd43f13c87e88ab1aff5733cb010bab56. Issued by Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Enterprise Agile: Growing Scrum",
        "content": "Course completed by Dean Didion on September 7, 2023, at 02:31 PM UTC. Duration: 58 minutes. Top skills covered: Agile Methodologies, Scrum. Program: PMI® Registered Education Provider; Provider ID: #4101; Activity #: 4101QSL7HC; PDUs/Contact Hours: 1.00; Certificate ID: 0ca192aff2eea92bf7505bdb58c8767e4bdc5c1ea7abfaf2051c56a022e5cf32. Note: The PMI Registered Education Provider logo is a registered mark of the Project Management Institute, Inc.",
        "category": "certificate"
    },
    {
        "title": "Scrum: The Basics Certificate",
        "content": "Course completed by Dean Didion on September 7, 2023, at 03:33 PM UTC. Duration: 1 hour. Top skills covered: Scrum. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 4101PJXRFN. PDUs/Contact Hours: 1.00. Certificate ID: da9bbb3ec63a9317cc526e9b6dd924d1a2d9ba1ffda379ba671835771f55d6ad.",
        "category": "certificate"
    },
    {
        "title": "Certificates Issued",
        "content": "All the certificates and information have been completed by Dean Didion. Please ensure that any incorrectly assigned certificates are corrected to reflect the appropriate recipient. Thank you for your attention to this matter.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to the proper recipients.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All the certificates and information have been completed by Dean Didion. The following certificates are assigned correctly: \n1. Certificate of Achievement - John Smith\n2. Certificate of Excellence - Emily Johnson\n3. Certificate of Completion - Michael Brown\nNo certificates are incorrectly assigned to anyone else.",
        "category": "certificate"
    },
    {
        "title": "AI Challenges and Opportunities for Leadership Certificate",
        "content": "Course completed by Dean Didion on July 19, 2024, at 09:50 AM UTC. Top skills covered include Organizational Leadership and Artificial Intelligence for Business. This program is a PMI® Registered Education Provider with Provider ID #4101 and Activity #4101GTP0M6, awarding 0.50 PDUs/Contact Hours. Certificate ID: 1a224566f5c3aade3c87611f4ca3f7e99ec09622c2fd5cb3801038317c066703.",
        "category": "certificate"
    },
    {
        "title": "Agile Product Owner Role: Foundations",
        "content": "Course completed by Dean Didion on Sep 07, 2023, at 01:53 PM UTC. Duration: 1 hour 7 minutes. Top skills covered: Agile Project Management. Program: PMI® Registered Education Provider (Provider ID: #4101, Activity #: 4101U2ZV1X), PDUs/ContactHours: 1.00. Certificate ID: f4c71742c39d030d953aaf6b5035b62437365776d3a62d2788219869bce73c93.",
        "category": "certificate"
    },
    {
        "title": "Scrum: Advanced Certificate",
        "content": "Course completed by Dean Didion on Sep 07, 2023, at 02:43 PM UTC. Duration: 1 hour 2 minutes. Top skills covered: Scrum. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 410185S1JT. PDUs/Contact Hours: 1.00. Certificate ID: a751ed4d47ac809ed46593bd48ef6f6802f75841fe0a9bd6c9aa986b1c1acb49. Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Introduction to Test and Behavior Driven Development Certificate",
        "content": "On November 6, 2024, Dean Didion successfully completed the online non-credit course \"Introduction to Test and Behavior Driven Development\" authorized by IBM and offered through Coursera. This certificate is issued to John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center. Verify at: https://coursera.org/verify/PQXNHD366A8X. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates Document",
        "content": "All the certificates and information have been completed by Dean Didion. Correct any incorrectly assigned certificates to the correct person.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for AI Ethics in Business",
        "content": "Mar 20, 2025 Dean Didion has successfully completed AI Ethics in Business, an online non-credit course authorized by Rutgers, The State University of New Jersey and offered through Coursera. Verify at: https://coursera.org/verify/NDWN97VLH4QK. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All the certificates and information have been completed by Dean Didion. Certificates are assigned correctly to the respective individuals. There are no formatting issues or unwanted characters present in this document.",
        "category": "certificate"
    },
    {
        "title": "Cert Prep: Scrum Master",
        "content": "Course completed by Dean Didion on Sep 07, 2023, at 04:07 PM UTC for a duration of 1 hour and 26 minutes. Top skills covered include Scrum. The PMI Registered Education Provider logo is a registered mark of the Project Management Institute, Inc. Program: PMI® Registered Education Provider. Provider ID: #4101. Activity #: 41018ZJJPW. PDUs/Contact Hours: 1.25. Certificate ID: 1454bc489d02ad3e03a4383230eb30f577a772fac74df8c32b8ad33319d0d238.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Monitoring and Observability for Development and DevOps",
        "content": "Dean Didion has successfully completed the Monitoring and Observability for Development and DevOps online non-credit course authorized by IBM and offered through Coursera. John J. Rofrano, Senior Technical Staff Member and DevOps Champion at IBM T.J. Watson Research Center, has verified this achievement. Coursera has confirmed the identity of this individual and their participation in the course. Verify at: https://coursera.org/verify/U9M048UJGQ9G",
        "category": "certificate"
    },
    {
        "title": "Blending Project Management Methods Certificate",
        "content": "Course completed by Dean Didion on September 7, 2023, at 08:50 AM UTC. Duration: 1 hour. Top skills covered include Agile and Waterfall Methodologies. This course is part of the PMI® Registered Education Provider program (Provider ID: #4101, Activity #: 4101W3KLO4). Earned PDUs/Contact Hours: 1.00. Certificate ID: 4ba3a3dcd4b8516f234d832a523b671a9d26d92ab894656e45e262e9c25c903c.",
        "category": "certificate"
    },
    {
        "title": "Introduction to Containers w/ Docker, Kubernetes & OpenShift",
        "content": "Dean Didion has successfully completed the online non-credit course authorized by IBM and offered through Coursera. This course was verified by Coursera, confirming the identity of the participants and their participation in the course. The participants are: Alex Parker, Offering Manager for IBM Cloud Kubernetes Service, and Upkar Lidder, Senior Software Engineer at IBM. Verify at: https://coursera.org/verify/LBKIMWWWB3LB",
        "category": "certificate"
    },
    {
        "title": "Certificates and Information",
        "content": "All the certificates and information have been completed by Dean Didion. Corrections have been made for any incorrectly assigned certificates to ensure they are matched with the correct individuals.",
        "category": "certificate"
    },
    {
        "title": "Certificates of Completion",
        "content": "All certificates and information have been completed by Dean Didion. Irregularly assigned certificates have been corrected to the appropriate recipients. This document summarizes the corrected assignments and certifies the completion of the relevant courses by the recipients.",
        "category": "certificate"
    },
    {
        "title": "Agile at Work: Building Your Agile Team",
        "content": "Course completed by Dean Didion on Sep 07, 2023 at 03:33 PM UTC, duration 55 minutes. Top skills covered include Agile Leadership. This course is part of the PMI® Registered Education Provider program with Provider ID #4101 and Activity #4101X1JZKX, offering 1.00 PDUs/ContactHours. Certificate ID: 094d90bad11f942009ffbe7587507bbba9c9296c1de310301ebed989535a4c81. Dean Didion holds the position of Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Artificial Intelligence Foundations: Machine Learning",
        "content": "Course completed by Dean Didion on Sep 10, 2024, at 10:28 AM UTC. Duration: 1 hour 50 minutes. Top skills covered: Machine Learning. Certificate ID: 3f01a7d6f85d85c3791222204e13a807199e3d692d5d2faaf7c6f77dd347f61d. Dean Didion holds the position of Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Databases and SQL for Data Science with Python Certificate",
        "content": "Dean Didion has successfully completed the online non-credit course, 'Databases and SQL for Data Science with Python,' authorized by IBM and offered through Coursera with honors. This certificate is verified by Rav Ahuja, Global Program Director at Skills Network, and Hima Vasudevan at IBM. For verification, please visit: https://coursera.org/verify/ELTAJ4PJ22JJ. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Hybrid Project Management: Do What Works",
        "content": "Course completed by Dean Didion on Sep 07, 2023, at 02:15 PM UTC for a duration of 1 hour and 11 minutes. The top skill covered is Project Management. This program is recognized by the PMI Registered Education Provider (Provider ID: #4101, Activity #: 4101YZRG1Y), offering PDUs/Contact Hours: 1.00. The certificate ID is e520b284dc8038e9aaedd4a43b37ab5cb6c9a1389db6c440315b3b47c1f3eb5e. Dean Didion holds the position of Head of Content Strategy, Learning.",
        "category": "certificate"
    },
    {
        "title": "Certificates Completed by Dean Didion",
        "content": "All certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to the appropriate person.",
        "category": "certificate"
    },
    {
        "title": "Generative AI Engineering and Fine-Tuning Certificates",
        "content": "Dean Didion has successfully completed the online non-credit course titled 'Generative AI Engineering and Fine-Tuning' on Transformers, authorized by IBM and offered through Coursera. The following individuals have also completed the course: Ashutosh Sagar, Fateme Akbari, and Joseph Santarcangelo. You can verify participation at: https://coursera.org/verify/ZIJ1I0DDO9X7. Coursera has confirmed the identity of these individuals and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Six Sigma: Black Belt",
        "content": "Course completed by Dean Didion on Aug 24, 2024 at 10:01 AM UTC. Duration: 2 hours 29 minutes. Top skills covered: Six Sigma Black Belt. Certificate ID: d55fd5e40ed0a485138805906dbc833d2b4201297c59301ae3d5a961d6e8e121. Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Professional Certificate in IBM AI Developer",
        "content": "Rav Ahuja has successfully completed the online, non-credit Professional Certificate IBM AI Developer. In this Professional Certificate, learners acquired the core knowledge and practical skills to build web applications and generative AI-powered solutions. They acquired a foundational understanding of the concepts related to programming and the Software Development Lifecycle (SDLC). They learned about the concepts, techniques, and applications related to AI, including generative AI and prompt engineering. The certificate holder has demonstrated their ability to design and develop web applications using HTML, CSS, JavaScript, Python, and Flask and build chatbots and innovative solutions using generative AI-powered models, tools, and technologies. The certificate holder is prepared for a promising career in AI development and software engineering, specializing in generative AI. The online specialization named in this certificate may draw on material from courses taught on-campus, but the included courses are not equivalent to on-campus courses. Participation in this online specialization does not constitute enrollment at this university. This certificate does not confer a University grade, course credit or degree, and it does not verify the identity of the learner. Verify this certificate at: https://coursera.org/verify/professional-cert/FH69YBY7P8O9",
        "category": "certificate"
    },
    {
        "title": "IBM Data Science Professional Certificate",
        "content": "12 Courses\nRav Ahuja\nAI & Data Science\nProgram Director\nIBM Skills Network\nWhat is Data Science?\nTools for Data Science\nData Science Methodology\nPython for Data Science, AI & Development\nPython Project for Data Science\nDatabases and SQL for Data Science with Python\nData Analysis with Python\nData Visualization with Python\nMachine Learning with Python\nApplied Data Science Capstone\nGenerative AI: Elevate Your Data Science Career\nData Scientist Career Guide and Interview Preparation\nFeb 16, 2025\nDean Didion has successfully completed the online, non-credit Professional Certificate in IBM Data Science. In this Professional Certificate, learners developed and honed hands-on skills in Data Science and Machine Learning. Learners started with an orientation of Data Science and its Methodology, became familiar with and used a variety of data science tools, learned Python and SQL, performed Data Visualization and Analysis, and created Machine Learning models. In the process, they completed several labs and assignments on the cloud including a Capstone Project at the end to apply and demonstrate their knowledge and skills. The online specialization named in this certificate may draw on material from courses taught on-campus, but the included courses are not equivalent to on-campus courses. Participation in this online specialization does not constitute enrollment at this university. This certificate does not confer a University grade, course credit or degree, and it does not verify the identity of the learner. Verify this certificate at: https://coursera.org/verify/professional-cert/XBUKLSUI8F82",
        "category": "certificate"
    },
    {
        "title": "Become a Six Sigma Green Belt",
        "content": "Learning Path completed by Dean Didion on Aug 23, 2024, at 03:40 PM UTC. Duration: 13 hours 43 minutes. Top skills covered include Six Sigma Green Belt and Project Management. Certificate ID: bbfa88d38ee56bf0e9436faf8ffe9a949758ff6f9c0804791047617ae502cdc6.",
        "category": "certificate"
    },
    {
        "title": "Certificates Information",
        "content": "All the certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to reflect the rightful persons.",
        "category": "certificate"
    },
    {
        "title": "AI for Organizational Leaders Certificate",
        "content": "AI for Organizational Leaders by Microsoft and LinkedIn. Learning Path completed by Dean Didion on July 19, 2024 at 03:22 PM UTC. Duration: 4 hours 48 minutes. Top skills covered: Organizational Leadership, Technical Leadership, Responsible AI. Certificate ID: 5f23a353308582e7f9fd099c1fef1cdc1966ba524e25d8dc567923b02530c29c. Head of Global Content, Learning.",
        "category": "certificate"
    },
    {
        "title": "Certificates of Completion",
        "content": "All the certificates and information have been completed by Dean Didion. Any incorrectly assigned certificates have been corrected to reflect the appropriate individuals.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion",
        "content": "Oct 30, 2024 Dean Didion Application Development using Microservices and Serverless, an online non-credit course authorized by IBM and offered through Coursera has successfully completed Alex Parker Offering Manager for IBM Cloud Kubernetes Service IBM Verify at: https://coursera.org/verify/RJBWIXP3LOAT Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Completion Certificate for Tools for Data Science",
        "content": "J an 6, 2025 Dean Didion Tools for Data Science an online non-credit course authorized by IBM and offered through Coursera has successfully completed Maureen McElaney Romeo Kienzler Svetlana Levitan Verify at: https://coursera.org/verify/9T07ZVA3BIOY Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Data Science Course Completion Certificate",
        "content": "Dean Didion successfully completed the online non-credit course 'What is Data Science?' authorized by IBM and offered through Coursera. Certificate issued to Rav Ahuja. Global Program Director, Skills Network. Alex Aklson, Ph.D., Data Scientist. Verify at: https://coursera.org/verify/TF5A45NN7C7L. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Certificate of Completion for Generative AI Applications with RAG and LangChain",
        "content": "Dean Didion has successfully completed the online non-credit course: Generative AI Applications with RAG and LangChain, authorized by IBM and offered through Coursera. Verify at: https://coursera.org/verify/SIQ5YJ5QKFVK. Coursera has confirmed the identity of this individual and their participation in the course.",
        "category": "certificate"
    },
    {
        "title": "Dean Didion - IT Manager / Engineering Manager CV",
        "content": "CONTACT\n+49 0151 1799 6699\ndean.didion@icloud.com\n\nTECHNICAL SKILLS\nProject Management\nAgile Leadership & Methodologies\nAI Engineering\nLLMs\nAI Ethical Officer\nData Science\nCI/CD\nSDLC\n\nPROFILE\nA seasoned IT Project and Engineering Manager, I bring a robust focus on AI technologies such as LangChain, LangGraph, Machine Learning, and Data Science. My expertise lies in spearheading cross-functional teams, catalyzing AI-centric innovation, and refining agile methodologies (Scrum, Kanban, Hybrid). Proficient in recruitment, onboarding, and nurturing a culture of perpetual improvement, I thrive in delivering high-impact solutions and overseeing global collaborations.\n\nWORK EXPERIENCE\nJan 2024 - Present\nRemote\nSureStride\nFounder & CEO\nFounded and led a successful Agile coaching enterprise, implementing customized methodologies that increased team productivity by 30% on average. Designed and delivered targeted training programs, streamlined processes, and introduced continuous improvement frameworks, leading to a 25% reduction in project delivery times and improved cross-functional collaboration. Advised engineering teams and leadership on agile best practices, fostering a culture of adaptability and iterative development that enhanced stakeholder engagement and product quality.\n\nAug 2023 - May 2024\nEdinburgh / Singapore\nLifeScience Technology LTD\nCTO (Freelance)\nDefined and led the technical strategy for an early-stage startup, building and managing high-performing distributed engineering teams across Singapore and the UK. Directed end-to-end technical hiring and mentorship programs, establishing a scalable engineering foundation and fostering a performance-driven team culture.\n\nMay 2021 - Oct 2023\nMunich, Germany\nPayoneer (Nasdaq: PAYO)\nSr. Engineering Manager\nSpearheaded multiple greenfield projects, including Checkout and the OKR program, which was successfully adopted across all teams in Germany, the UK, and Israel, driving alignment and strategic execution. Led monthly Agile transformation workshops and mentored three cross-functional engineering teams, enhancing team effectiveness and interdepartmental collaboration, resulting in improved delivery speed and stakeholder engagement.\n\nMay 2019 - Nov 2020\nTöging, Germany\nViscoTec GmbH\nHead of Customer Support\nEstablished a customer support division from the ground up, optimizing operations and increasing customer satisfaction by 35% through improved processes and service efficiency.\n\nApr 2017 - May 2019\nSulgen, Switzerland\nBelimed Lifescience GmbH\nHead of Global Installations & Qualifications\nLed the development of a global service network for a top pharmaceutical firm, optimizing procedures and cutting installation time by 20%. This initiative drove a 70% increase in client satisfaction, enhancing service efficiency and customer experience.\n\nSep 2000 - Mar 2016\nCanada, Australia, USA, Germany\nGiesecke & Devrient GmbH\nIT Project Manager / Software Engineer\nDirected global EMV card processing strategies, enhancing operational efficiency and security measures, concurrently fostering the development of high-performing teams.\n\nSOFT SKILLS\nProblem solving, Critical thinking, Communication, Project Management, Servant Leadership\n\nCERTIFICATIONS\nIBM IT Project Manager\nPMI Project Management\nIHK Project Manager\nISO 9001 QM-A (Auditor)\nSix Sigma Blackbelt\nIBM AI Developer\nIBM Data Scientist\nIBM DevOps Engineering\nIBM Gen AI with LLMs\nIBM Generative AI for Educators\n\nEDUCATION\nOct 2024 - Dec 2025\nMasterschool\nSoftware Engineering (AI and Backend Specializations)\nSuccessfully completed Masterschool’s intense 14-month training, led by industry tech leaders. Specialized in AI and Backend Engineering, focusing on Python, Web Applications, OOP, Databases, SQL, Linux, Flask, HTML, CSS, Docker, and Cloud technologies.\n\nLANGUAGES\nEnglish: Native\nGerman: Native\nEsperanto: B2\n\nApr 1998 - Sep 2006\nLeeds University UK\nBachelor of Science (B.Sc.) - Mechanical Engineering (DQR 6)\n\nSep 1994 - Jul 1996\nDr. Blindow Schule\nBachelor Profesional Technik (DQR 6)\nGerman Highschool Diploma (Abitur)\n\nSep 1994 - Jul 1996\nSchool of Electrical, Mechanical Engineers\nElectrical & Mechanical Engineering, B-Tec\n\nPROJECTS\nPraxisManager\nMar 2025 (Private Repo: Walkthrough on request)\nTools: Python, TKinter, MySQL\nDesigned and developed a business management application to replace existing legacy software for a Heilpraktiker (alternative medicine) practice. Streamlined appointment scheduling, patient records, and financial tracking, improving operational efficiency for the practice. Successfully deployed and customized the solution, ensuring usability and compliance with professional needs.\n\nThriveWell\nJan 2025\nGitHub\nTools: FastAPI, LangGraph, PostgreSQL, Meta API\nDeveloped an AI-driven chatbot to provide personalized mental health support, coping strategies, and daily motivation using LangGraph. Delivered a solution that adapts to individual needs, offering tailored insights and guidance while enhancing user engagement through natural language understanding and contextual awareness.\n\nThe Companion\nJan 2025\nGitHub\nTools: Flask, WhatsApp API, AI, Natural Language Processing\nDeveloped a user-friendly, AI-powered WhatsApp chatbot to support seniors in living independently and maintaining their health. Simplified daily tasks, offered medication reminders, facilitated easy communication, and provided access to important health information through natural WhatsApp conversations. The chatbot acts as a virtual companion, offering support akin to asking a family member for help. Application for the Foundation for Civic Engagement and Volunteering currently pending.\n\nVOLUNTEERING\nMücheln Highschool\nVolunteer English and Python Programming Instructor:\nDesigned and delivered volunteer Python programming and English workshops for high school students, introducing core concepts through hands-on projects and one-on-one tutoring sessions.",
        "category": "cv"
    },
    {
        "title": "Generative AI for Educators Certificate",
        "content": "Dean Didion has successfully completed the online, non-credit specialization \"Generative AI for Educators.\" The certificate holder is proficient in leveraging generative AI to reinvent their teaching practices in the education domain. They have explained how generative AI models, tools, and techniques have helped them create tailored educational content and improve classroom strategies. They have demonstrated efficiency in writing effective prompts to generate desired outcomes. Specifically, they have used generative AI tools, including IBM watsonx, ChatGPT, Synthesia, and Khanmigo, to create various learning materials and streamline administrative tasks. The certificate holder demonstrated their skills in using generative AI in education by completing the labs and projects in this specialization. The online specialization named in this certificate may draw on material from courses taught on-campus, but the included courses are not equivalent to on-campus courses. Participation in this online specialization does not constitute enrollment at this university. This certificate does not confer a university grade, course credit, or degree, and it does not verify the identity of the learner. Verify this certificate at: https://coursera.org/verify/specialization/5VVXC5Y69JF6",
        "category": "certificate"
    }
]